import sys

N, M = map(int, sys.stdin.readline().split())
arr = [list(map(int, sys.stdin.readline().split())) for _ in range(N)]

Tetro = [
    # ㅡ 모양
    [(0, 0), (0, 1), (0, 2), (0, 3)], [(0, 0), (1, 0), (2, 0), (3, 0)],
    # ㅁ 모양
    [(0, 0), (0, 1), (1, 0), (1, 1)],
    # ㅗ 모양
    [(0, 0), (1, 0), (2, 0), (1, 1)], [(0, 0), (1, 0), (2, 0), (1, -1)],
    [(0, 0), (0, 1), (0, 2), (1, 1)], [(0, 0), (0, 1), (0, 2), (-1, 1)],
    # ㄱㄴ 모양
    [(0, 0), (0, 1), (1, 1), (1, 2)], [(0, 0), (0, 1), (-1, 1), (-1, 2)],
    [(0, 0), (1, 0), (1, 1), (2, 1)], [(0, 0), (1, 0), (1, -1), (2, -1)],
    # L 모양
    [(0, 0), (1, 0), (2, 0), (2, 1)], [(0, 0), (1, 0), (2, 0), (2, -1)],
    [(0, 0), (0, 1), (0, 2), (1, 2)], [(0, 0), (0, 1), (0, 2), (1, 0)],
    [(0, 0), (0, 1), (1, 1), (2, 1)], [(0, 0), (0, 1), (1, 0), (2, 0)],
    [(0, 0), (1, 0), (1, 1), (1, 2)], [(0, 0), (1, 0), (1, -1), (1, -2)]
]

result = 0
for i in range(N):
    for j in range(M):
        for T in Tetro:
            temp = 0
            valid = True
            for di, dj in T:
                ni, nj = i + di, j + dj
                if 0 <= ni < N and 0 <= nj < M:
                    temp += arr[ni][nj]
                else:
                    valid = False
                    break
            if valid:
                result = max(result, temp)

print(result)